# Напишите программу, которая принимает на вход
# координаты двух точек и находит расстояние между ними в 2D пространстве.

x1 = float(input('Введите координату первой точки по оси x: '))
y1 = float(input('Введите координату первой точки по оси y: '))
x2 = float(input('Введите координату второй точки по оси x: '))
y2 = float(input('Введите координату второй точки по оси y: '))

dist = round((((x1 - x2)**2 + (y1 - y2)**2)**0.5), 2)
print(f'Расстояние между двумя точками в 2D пространстве: {dist}')
