# Напишите программу, которая принимает на вход цифру,
# обозначающую день недели, и проверяет, является ли этот день выходным.

a = int(input())

if 6 <= a <= 7:
    print('Выходные')
elif a > 0 and a <= 5:
    print('Будни')
else:
    print('Ошибка, введите число от 1 до 7')
