# Напишите программу, которая будет преобразовывать
# десятичное число в двоичное.

num = int(input('Введите десятичное число: '))
x = ''

while num != 0:
    x = str(num % 2) + x
    num //= 2

print(f'Двоичное число: {x}')
