# Напишите программу, которая найдёт произведение пар чисел списка.
# Парой считаем первый и последний элемент, второй и предпоследний и т.д.

list = [2, 3, 4, 5, 6]
list1 = []
i = 0

while i < len(list) / 2:
    list1.append(list[i] * list[(len(list)-1)-i])
    i += 1

print(f'Произведение пар чисел списка = {list1}')
