# Задайте список из вещественных чисел. Напишите программу, которая найдёт
# разницу между максимальным и минимальным значением дробной части элементов.

list = [1.1, 1.2, 3.1, 5, 10.01]
min = 0
max = 0

for i in list:
    if i % 1 > max:
        max = i % 1
    else:
        min = i % 1

print('Разница между max и min значением = ', round(max - min, 2))
