# Задайте число. Составьте список чисел Фибоначчи,
# в том числе для отрицательных индексов. (Дополнительное)

a = int(input('Введите число: '))
fib = [0]*(a*2+1)
fib[a] = 0
fib[a+1] = 1

for i in range(a+2, len(fib)):
    fib[i] = fib[i-2] + fib[i-1]

for i in range(a, -1, -1):
    fib[i] = fib[i+2] - fib[i+1]

print(f'Список Фибоначчи: {fib}')
