# Модуль для ввода/вывода информации


def choose() -> str:
    """Выбор режима работы приложения"""
    print('Введите 1 для решения примеров')
    print('Введите 2 для решения уравнений')
    print('Введите 3 для упрощения многочлена')
    print('Введите 4 для показа истории операций')
    return input()


def get_expr() -> str:
    """Запрашивает у пользователя задачу"""
    return input('Введите задачу: ')


def show_res(res: str):
    """Выводит результат"""
    print('Результат:', res)


def error_mode():
    """Выводит сообщение об ошибке выбора режима"""
    print('Ошибка выбора режима')


def show_history(history: str):
    """Выводит историю операций"""
    for i in history.split('\n'):
        print(i.replace(';', ' -> Результат: '))
