# Задайте список из N элементов, заполненных числами из промежутка [-N, N].
# Найдите произведение элементов на указанных позициях.
# Позиции хранятся в файле file.txt в одной строке одно число.
# (для продвинутых - с файлом, вариант минимум - ввести позиции в консоли)


# С файлом пока не разобрался, поэтому сделал вариант для консоли:

n = int(input('Введите число: '))
list = [i for i in range(-n, n+1)]
element_list = []
a = 1

print('Введите количество элементов: ')
count = int(input())
print('Введите номера позиций элементов: ')

while count != 0:
    element_list.append(input())
    count -= 1

for i in element_list:
    a *= int(list[int(i)])
    print(f'Произведение элементов: {a}')
