# Напишите программу, которая принимает на вход число N
# и выдает набор произведений чисел от 1 до N.

n = int(input('Введите число: '))
fact = 1
a = 1

while n >= a:
    fact = fact*a
    a += 1
    print(fact)
