# Вычислить число Пи c заданной точностью d

from math import pi

n = int(input('Введите число для заданной точности числа Пи: '))
print(f'число Пи: {round(pi, n)}')
